; domain
(define (domain emergency)

(:requirements :strips :typing)

(:types
location                    ; where person, robot, box and content can be
person                      ; person in need of help, is at a specific location
robot                       ; carries boxes to person, can move btw locations
carrier                     ; contains more boxes, it is part of the robot
place                       ; each carrier contain
box                         ; containts emergency supplies
food medicine tool - supply ; supplies to be brought to people
)

(:constants 
depot - location)

(:predicates
(patl ?p - person ?l - location)        ; person ?p is at location ?l
(ratl ?r - robot ?l - location)         ; robot ?r is at location ?l
(batl ?b - box ?l - location)           ; box ?b is at location ?l
(satl ?s - supply ?l - location)        ; supply ?s is at location ?l

(hascarrier ?r - robot ?c - carrier)                ; robot ?r has carrier ?c
(hasplace ?c - carrier ?pl - place)                 ; carrier ?c has space ?pl
(hasbox ?pl - place ?b - box)              ; place ?pl has a box ?b
(free ?pl - place)                         ; place ?pl is free


(contain ?b - box ?s - supply)          ; box ?b contains supply ?s
(empty ?b - box)                        ; box ?b is empty

(have ?p - person ?s - supply)          ; person ?p has supply ?s
)

; actions

; move robot btw locations
(:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and (ratl ?r ?from))
    :effect (and (ratl ?r ?to) (not (ratl ?r ?from)))
)

; robot loads a box if robot and box are in the same location
(:action load
    :parameters (?r - robot ?b - box ?l - location ?c - carrier ?pl - place)
    :precondition (and (ratl ?r ?l) (batl ?b ?l) (hascarrier ?r ?c) (hasplace ?c ?pl) (free ?pl))
    :effect (and (hasbox ?pl ?b) (not (free ?pl)) (not (batl ?b ?l)))
)

; robot unloads a box at some location
(:action unload
    :parameters (?r - robot ?b - box ?l - location ?c - carrier ?pl - place)
    :precondition (and (ratl ?r ?l) (hascarrier ?r ?c) (hasplace ?c ?pl) (hasbox ?pl ?b))
    :effect (and (batl ?b ?l) (free ?pl) (not (hasbox ?pl ?b)))
)

; fill a box with a content, if the box is empty and the supply, the box and the agent are at the same location;
(:action fill
    :parameters (?r - robot ?l - location ?b - box ?s - supply)
    :precondition (and (empty ?b) (ratl ?r ?l) (batl ?b ?l) (satl ?s ?l))
    :effect (and (contain ?b ?s) (not (empty ?b)))
)

; empty a box by leaving the content to the current location, and causing the people at the same location to have the content
(:action give
    :parameters (?r - robot ?l - location ?b - box ?s - supply ?p - person)
    :precondition (and (ratl ?r ?l) (batl ?b ?l) (contain ?b ?s) (patl ?p ?l))
    :effect (and (have ?p ?s) (empty ?b) (not (contain ?b ?s)))
)


)

; problem
(define (problem part2) (:domain emergency)
(:objects
 l1 l2 l3 - location
 p1 p2 p3 - person 
 r1 - robot
 c1 - carrier
 pl1 pl2 pl3 pl4 - place
 b1 b2 b3 b4 - box
 f - food
 m - medicine
 t - tool
)

(:init
    ; robot, boxes and supply are at the same location (depot)
    (ratl r1 depot)
    (batl b1 depot)
    (batl b2 depot)
    (batl b3 depot)
    (batl b4 depot)
    (satl f depot)
    (satl m depot)
    (satl t depot)

    ; robot has carrier, carrier has places
    (hascarrier r1 c1)
    (hasplace c1 pl1)
    (hasplace c1 pl2)
    (hasplace c1 pl3)
    (hasplace c1 pl4)

    ; places and box are empty
    (free pl1)
    (free pl2)
    (free pl3)
    (free pl4)

    (empty b1)
    (empty b2)
    (empty b3)
    (empty b4)

    ; location of people
    (patl p1 l2)
    (patl p2 l2)
    (patl p3 l3)


)

(:goal (and
    (have p1 f)
    (have p2 f)
    (have p2 t)
    (have p3 m)
))

)

; plan
1. (fill r1 depot b1 f)
   deleted: (empty b1)
   added: (contain b1 f)
   goals met: 0 of 4
2. (fill r1 depot b2 m)
   deleted: (empty b2)
   added: (contain b2 m)
   goals met: 0 of 4
3. (fill r1 depot b3 t)
   deleted: (empty b3)
   added: (contain b3 t)
   goals met: 0 of 4
4. (load r1 b1 depot c1 pl4)
   deleted: (free pl4) (batl b1 depot)
   added: (hasbox pl4 b1)
   goals met: 0 of 4
5. (move r1 depot l2)
   deleted: (ratl r1 depot)
   added: (ratl r1 l2)
   goals met: 0 of 4
6. (unload r1 b1 l2 c1 pl4)
   deleted: (hasbox pl4 b1)
   added: (batl b1 l2) (free pl4)
   goals met: 0 of 4
7. (move r1 l2 depot)
   deleted: (ratl r1 l2)
   added: (ratl r1 depot)
   goals met: 0 of 4
8. (load r1 b2 depot c1 pl4)
   deleted: (free pl4) (batl b2 depot)
   added: (hasbox pl4 b2)
   goals met: 0 of 4
9. (load r1 b3 depot c1 pl3)
   deleted: (free pl3) (batl b3 depot)
   added: (hasbox pl3 b3)
   goals met: 0 of 4
10. (move r1 depot l2)
   deleted: (ratl r1 depot)
   added: (ratl r1 l2)
   goals met: 0 of 4
11. (unload r1 b3 l2 c1 pl3)
   deleted: (hasbox pl3 b3)
   added: (batl b3 l2) (free pl3)
   goals met: 0 of 4
12. (give r1 l2 b3 t p2)
   deleted: (contain b3 t)
   added: (have p2 t) (empty b3)
   goals met: 1 of 4
13. (move r1 l2 l3)
   deleted: (ratl r1 l2)
   added: (ratl r1 l3)
   goals met: 1 of 4
14. (unload r1 b2 l3 c1 pl4)
   deleted: (hasbox pl4 b2)
   added: (batl b2 l3) (free pl4)
   goals met: 1 of 4
15. (give r1 l3 b2 m p3)
   deleted: (contain b2 m)
   added: (have p3 m) (empty b2)
   goals met: 2 of 4
16. (move r1 l3 l2)
   deleted: (ratl r1 l3)
   added: (ratl r1 l2)
   goals met: 2 of 4
17. (give r1 l2 b1 f p1)
   deleted: (contain b1 f)
   added: (have p1 f) (empty b1)
   goals met: 3 of 4
18. (move r1 l2 depot)
   deleted: (ratl r1 l2)
   added: (ratl r1 depot)
   goals met: 3 of 4
19. (fill r1 depot b4 f)
   deleted: (empty b4)
   added: (contain b4 f)
   goals met: 3 of 4
20. (load r1 b4 depot c1 pl4)
   deleted: (free pl4) (batl b4 depot)
   added: (hasbox pl4 b4)
   goals met: 3 of 4
21. (move r1 depot l2)
   deleted: (ratl r1 depot)
   added: (ratl r1 l2)
   goals met: 3 of 4
22. (unload r1 b4 l2 c1 pl4)
   deleted: (hasbox pl4 b4)
   added: (batl b4 l2) (free pl4)
   goals met: 3 of 4
23. (give r1 l2 b4 f p2)
   deleted: (contain b4 f)
   added: (have p2 f) (empty b4)
   goals met: 4 of 4
